Revit 2024 API
StructuralSectionConcreteRectangleCut Class
 Defines parameters for parameterized concrete rectangle cut structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class StructuralSectionConcreteRectangleCut : StructuralSectionRectangular
Visual Basic
Public Class StructuralSectionConcreteRectangleCut _
	Inherits StructuralSectionRectangular
Visual C++
public ref class StructuralSectionConcreteRectangleCut : public StructuralSectionRectangular
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangleCut
See Also
StructuralSectionConcreteRectangleCut Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace